Tekla Open API Reference for Tekla Structures 2025
IRelatedObjects Methods
Methods
Name | Description
GetRelatedObjects()
 Gets the related objects of the current object.
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
Top
See Also
Reference
IRelatedObjects Interface
Tekla.Structures.Drawing Namespace